Documents/ВедомостьРабот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<Document>
		<Properties>
			<Name>ВедомостьРабот</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ВыполненныеРаботы</xr:Item>
				<xr:Item>AccumulationRegister.ВыработкаСотрудников</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Бригадир</Name>
					<Comment>Ответственный за работы</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаРабот</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияРабот</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Исполнители</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Исполнитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Работы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторРаботы</Name>
							<Comment>Идентификатор строки работы</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Работа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РеестрыРабот</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыполненоНаНачало</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РаспределениеПоРаботам</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторРаботы</Name>
							<Comment>Идентификатор строки работы</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Исполнитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентУчастия</Name>
							<Comment>Процент участия исполнителя при выполнении данной работы</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ВыполненныеРаботы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<AccumulationRegister>
		<Properties>
			<Name>ВыполненныеРаботы</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Работа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РеестрыРабот</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ВыработкаСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<AccumulationRegister>
		<Properties>
			<Name>ВыработкаСотрудников</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПроцентУчастия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Работа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РеестрыРабот</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Бригадир</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаНачала</Name>
					<Comment>Дата начала выполнения работы</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Comment>Дата окончания выполнения работы</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/ВедомостьРабот/Ext/ObjectModule.bsl
Функция ПолучитьОбязательныеРеквизиты() Экспорт 

	РеквизитыДляПроверки = Новый Структура;
	
    РеквизитыТЧ_Исполнители = Новый Структура();       
    РеквизитыТЧ_Исполнители.Вставить("Исполнитель", 2);
    РеквизитыДляПроверки.Вставить("Исполнители", РеквизитыТЧ_Исполнители); 
	
	РеквизитыТЧ_Работы = Новый Структура();  
	РеквизитыТЧ_Работы.Вставить("Работа", 2);
    РеквизитыДляПроверки.Вставить("Работы",РеквизитыТЧ_Работы); 
	
    Возврат РеквизитыДляПроверки;             
    
КонецФункции

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Отказ = ПроверитьНаПересечениеПериодов();
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;	
	
	Движения.ВыполненныеРаботы.Записывать = Истина;
	Движения.ВыполненныеРаботы.Очистить();
	
	Движения.ВыработкаСотрудников.Записывать = Истина;
	Движения.ВыработкаСотрудников.Очистить();
	
	Для Каждого Стр Из Работы Цикл
		
		Движение = Движения.ВыполненныеРаботы.Добавить();
		Движение.Период 	= ДатаОкончанияРабот;
		Движение.Проект 	= Проект;
		Движение.Работа 	= Стр.Работа;
		Движение.Количество = Стр.Количество;
		Движение.Комментарий = Стр.Комментарий;
		
	КонецЦикла;
	
	Для Каждого Стр Из РаспределениеПоРаботам Цикл
		
		Движение = Движения.ВыработкаСотрудников.Добавить();
		Движение.Период 		= Дата;
		Движение.Проект 		= Проект;
		Движение.Работа 		= Работы.Найти(Стр.ИдентификаторРаботы, "ИдентификаторРаботы").Работа;
		Движение.Сотрудник 		= Стр.Исполнитель;
		Движение.Бригадир		= Бригадир;
		Движение.ДатаНачала		= ДатаНачалаРабот;
		Движение.ДатаОкончания	= ДатаОкончанияРабот;
		Движение.ПроцентУчастия = Стр.ПроцентУчастия;
		
	КонецЦикла;
	
	Движения.Записать();
	
КонецПроцедуры

Функция ПроверитьНаПересечениеПериодов()
	
	ЕстьПересечения = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВыработкаСотрудников.Регистратор,
	|	ВыработкаСотрудников.Сотрудник
	|ИЗ
	|	РегистрНакопления.ВыработкаСотрудников КАК ВыработкаСотрудников
	|ГДЕ
	|	ВыработкаСотрудников.Сотрудник В(&Сотрудники)
	|	И ВыработкаСотрудников.Проект = &Проект
	|	И (&ДатаНачала МЕЖДУ ВыработкаСотрудников.ДатаНачала И ВыработкаСотрудников.ДатаОкончания
	|			ИЛИ &ДатаОкончания МЕЖДУ ВыработкаСотрудников.ДатаНачала И ВыработкаСотрудников.ДатаОкончания)
	|	И ВыработкаСотрудников.Регистратор <> &Регистратор";
	
	Запрос.УстановитьПараметр("Сотрудники"		, Исполнители.ВыгрузитьКолонку("Исполнитель"));
	Запрос.УстановитьПараметр("Проект"			, Проект);
	Запрос.УстановитьПараметр("ДатаНачала"		, ДатаНачалаРабот);
	Запрос.УстановитьПараметр("ДатаОкончания"	, ДатаОкончанияРабот);
	Запрос.УстановитьПараметр("Регистратор"		, Ссылка);
	
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		ЕстьПересечения = Истина;
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			Сообщить("Сотрудник <"+Выборка.Сотрудник+"> в данный период работы уже занят на этом проекте");	
		КонецЦикла;
	КонецЕсли;
	
	Возврат ЕстьПересечения;
		
КонецФункции
